app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    if params[:category_id]
      @products = @category.products
    else
      @products = Product.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_category
      @category = Category.find(params[:category_id])